Examinator/src/InformationRegisters/СтудентыОО/СтудентыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтудентыОО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.КурсыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСтудентовОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.СпециализацииОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/УчебныеГруппыОО/УчебныеГруппыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеГруппыОО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПоступления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникТерриторииСУО</name>
      <description>Контактная информация справочника &quot;Территории&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonForms/ПодборПользователейСУО/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем необходимые реквизиты
	
	ЭтоОбразовательнаяОрганизация = ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО");	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	ЭтоЭкзаменатор = ПолучитьФункциональнуюОпцию("ЭкзаменаторЭР");
	ИспользуютсяСлушатели = ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО");
	ИспользоватьСотрудников = ПолучитьФункциональнуюОпцию("ИспользоватьСотрудниковСУО");
	ИспользоватьСтудентов = ПолучитьФункциональнуюОпцию("ИспользоватьСтудентовСУО");
	
	ГруппаПользователейВсеПользователи = Справочники.ГруппыПользователей.ВсеПользователи;
	
	Если ЗначениеЗаполнено(Параметры.ВариантПодбора) Тогда
		
		ВариантПодбора = Параметры.ВариантПодбора;		
		Элементы.ВариантыПодбора.Видимость = Ложь;	
		
	Иначе
		
		ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ЭтотОбъект.ИмяФормы+"/ТекущиеДанные");		
		Если ДанныеНастроек = Неопределено Тогда
			ВариантПодбора = "ОбщийСписок";
		Иначе
			ВариантПодбора = ДанныеНастроек.Получить("ВариантПодбора");
		КонецЕсли;
		
	КонецЕсли;
	
	ХранимыеПараметры = Новый Структура;	
	ХранимыеПараметры.Вставить("ИспользоватьГруппы", ПолучитьФункциональнуюОпцию("ИспользоватьГруппыПользователей"));
	
	// Заполняем таблицу ВыбранныеПользователи
	
	Если Параметры.РасширенныйПодбор И ЗначениеЗаполнено(Параметры.ПараметрыРасширеннойФормыПодбора) Тогда
		
		ХранимыеПараметры.Вставить("РасширенныйПодбор", Истина);
		
		ПараметрыРасширеннойФормыПодбора = ПолучитьИзВременногоХранилища(Параметры.ПараметрыРасширеннойФормыПодбора);
		
		ХранимыеПараметры.Вставить("ЗаголовокФормыПодбора", ПараметрыРасширеннойФормыПодбора.ЗаголовокФормыПодбора);
		
		Если ТипЗнч(ПараметрыРасширеннойФормыПодбора.ВыбранныеПользователи) = Тип("ТаблицаЗначений") Тогда
			ВыбранныеПользователи.Загрузить(ПараметрыРасширеннойФормыПодбора.ВыбранныеПользователи);
		Иначе
			Для Каждого ВыбранныйПользователь Из ПараметрыРасширеннойФормыПодбора.ВыбранныеПользователи Цикл
				ВыбранныеПользователи.Добавить().Пользователь = ВыбранныйПользователь;
			КонецЦикла;
		КонецЕсли;		
		
		// Находим недействительных пользователей
		
		МассивПодобранныхПользователей = ВыбранныеПользователи.Выгрузить(,"Пользователь");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Ссылка В(&МассивПодобранныхПользователей)
			|	И Пользователи.Недействителен = ИСТИНА";
		
		Запрос.УстановитьПараметр("МассивПодобранныхПользователей", МассивПодобранныхПользователей);
		
		МассивНедействительныхПользователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");

		// Заполняем недостающие реквизиты
		
		Для каждого Строка Из ВыбранныеПользователи Цикл
			Строка.ВыбранРаньше = Истина;	
			Строка.НомерКартинки = 7;
			Строка.Недействителен = ?(МассивНедействительныхПользователей.Найти(Строка.Пользователь) <> Неопределено, Истина, Ложь);
		КонецЦикла;
		
	Иначе
		
		ХранимыеПараметры.Вставить("РасширенныйПодбор", Ложь);
		ХранимыеПараметры.Вставить("ЗаголовокФормыПодбора", НСтр("ru = 'Подбор пользователей'"));
		
	КонецЕсли;
	
	ВыбранныеПользователи.Сортировать("Пользователь");
	
	// Формируем варианты подбора
	
	ЗначениеДляУдаления = Элементы.ВариантыПодбора.СписокВыбора.НайтиПоЗначению("Подчиненные");
	Элементы.ВариантыПодбора.СписокВыбора.Удалить(ЗначениеДляУдаления);	
	
	Если ЭтоОбразовательнаяОрганизация ИЛИ ЭтоЭкзаменатор ИЛИ ИспользуютсяСлушатели Тогда
		
		ЗначениеДляУдаления = Элементы.ВариантыПодбора.СписокВыбора.НайтиПоЗначению("Мероприятия");
		Элементы.ВариантыПодбора.СписокВыбора.Удалить(ЗначениеДляУдаления);
		
		ЗначениеДляУдаления = Элементы.ВариантыПодбора.СписокВыбора.НайтиПоЗначению("ПрограммыОбучения");
		Элементы.ВариантыПодбора.СписокВыбора.Удалить(ЗначениеДляУдаления);
		
	КонецЕсли;
	
	Если НЕ ИспользоватьСотрудников Тогда
	
		ЗначениеДляУдаления = Элементы.ВариантыПодбора.СписокВыбора.НайтиПоЗначению("СтруктураОрганизации");
		Элементы.ВариантыПодбора.СписокВыбора.Удалить(ЗначениеДляУдаления);		
		
		ЗначениеДляУдаления = Элементы.ВариантыПодбора.СписокВыбора.НайтиПоЗначению("УчебныеГруппы");
		Элементы.ВариантыПодбора.СписокВыбора.Удалить(ЗначениеДляУдаления);		
		
	КонецЕсли;
	
	Если НЕ ИспользоватьСтудентов Тогда
		
		ЗначениеДляУдаления = Элементы.ВариантыПодбора.СписокВыбора.НайтиПоЗначению("Студенты");
		Элементы.ВариантыПодбора.СписокВыбора.Удалить(ЗначениеДляУдаления);
		
		ЗначениеДляУдаления = Элементы.ВариантыПодбора.СписокВыбора.НайтиПоЗначению("УчебныеГруппыОО");
		Элементы.ВариантыПодбора.СписокВыбора.Удалить(ЗначениеДляУдаления);
		
	КонецЕсли;
	
	// Устанавливаем начальные параметры динамических список
	
	ПользователиОбщийСписок.Параметры.УстановитьЗначениеПараметра("ГруппаПользователей", Справочники.ГруппыПользователей.ВсеПользователи);
	
	ПользователиОбщийСписок.Параметры.УстановитьЗначениеПараметра("ВыбиратьИерархически", Истина);
	ПользователиОбщийСписок.Параметры.УстановитьЗначениеПараметра("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	ПользователиУчебныхГрупп.Параметры.УстановитьЗначениеПараметра("УчебнаяГруппа", Справочники.УчебныеГруппыСУО.ПустаяСсылка());
	
	ПользователиМероприятий.Параметры.УстановитьЗначениеПараметра("ПроведениеОбучения", Документы.ПроведениеОбученияСУО.ПустаяСсылка());
	ПользователиМероприятий.Параметры.УстановитьЗначениеПараметра("Сценарий", Справочники.КаталогМероприятийСУО.ПустаяСсылка());
	
	ПользователиПрограммОбучения.Параметры.УстановитьЗначениеПараметра("ПроведениеПрограммыОбучения", Документы.ПроведениеПрограммыОбученияСУО.ПустаяСсылка());
	
	Подчиненные.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	Подчиненные.Параметры.УстановитьЗначениеПараметра("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	ПользователиУчебныхГруппОО.Параметры.УстановитьЗначениеПараметра("УчебнаяГруппа", Справочники.УчебныеГруппыОО.ПустаяСсылка());
	
	ЗаполнитьТаблицуНастроекДоступа();
	УстановитьПараметрыНастроекДоступаПоУмолчанию();

	
	// Управляем интерфейсом формы
	
	УстановитьДоступностьЭлементовФормы();	
	
	Заголовок = ХранимыеПараметры.ЗаголовокФормыПодбора;
	
	Если ХранимыеПараметры.РасширенныйПодбор Тогда
		ЗакрыватьПриВыборе = Истина; // Всегда, для корректной отработки ОповеститьОВыборе
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВариантПодбора = "ОбщийСписок" Тогда
		ОбновитьСодержимоеФормыПриИзмененииГруппы();
	КонецЕсли;
	
	Если ВариантПодбора = "УчебныеГруппы" Тогда
		ОбновитьСодержимоеФормыПриИзмененииУчебнойГруппы();
	КонецЕсли;
	
	Если ВариантПодбора = "СтруктураОрганизации" Тогда
		ОбновитьСодержимоеФормыПриИзмененииПараметровСтруктурыОрганизации();
	КонецЕсли;
	
	Если ВариантПодбора = "Мероприятия" Тогда
		ОбновитьСодержимоеФормыПриИзмененииМероприятия();
	КонецЕсли;
	
	Если ВариантПодбора = "ПрограммыОбучения" Тогда
		ОбновитьСодержимоеФормыПриИзмененииПрограммыОбучения();
	КонецЕсли;

	Если ВариантПодбора = "УчебныеГруппыОО" Тогда
		ОбновитьСодержимоеФормыПриИзмененииУчебнойГруппыОО();		
	КонецЕсли;
	
	Если ВариантПодбора = "Студенты" Тогда
		ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов();
	КонецЕсли;
	
	ФормированиеПоляВводаТаблицыНастроекДоступа(Элементы.ТаблицаНастроекДоступа);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_Пользователи" Тогда
		СброситьТаблицуПользователейИБ();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(НовыйОбъект)
		И ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.Пользователи") Тогда
		
		ВыбратьПользователя(НовыйОбъект);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВариантыПодбораПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

// Структура организации

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииПараметровСтруктурыОрганизации()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		МассивПараметровВыбора = Новый Массив();
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Организация));
		Элементы.ПодразделениеОрганизации.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Должность) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПользователиОрганизаций.Отбор, "Должность", Должность);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ПользователиОрганизаций.Отбор, "Должность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПользователиОрганизаций.Отбор, "Организация", Организация);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ПользователиОрганизаций.Отбор, "Организация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПользователиОрганизаций.Отбор, "ПодразделениеОрганизации", ПодразделениеОрганизации);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ПользователиОрганизаций.Отбор, "ПодразделениеОрганизации");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодразделениеПредприятия) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПользователиОрганизаций.Отбор, "ПодразделениеПредприятия", ПодразделениеПредприятия);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ПользователиОрганизаций.Отбор, "ПодразделениеПредприятия");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииПараметровСтруктурыОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОрганизацииПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииПараметровСтруктурыОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПредприятияПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииПараметровСтруктурыОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииПараметровСтруктурыОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ПользователиОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);
	
	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

// Общий список

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииГруппы()
	
	ТекущиеДанные = Элементы.СписокГруппПользователей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СписокГруппПользователей.ТекущаяСтрока = ГруппаПользователейВсеПользователи Тогда
		Элементы.ГруппаПоказыватьПользователейДочернихГрупп.ТекущаяСтраница = Элементы.ГруппаНельзяУстановитьСвойство;
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиОбщийСписок, "ВыбиратьИерархически", Истина);
	Иначе
		Элементы.ГруппаПоказыватьПользователейДочернихГрупп.ТекущаяСтраница = Элементы.ГруппаУстановитьСвойство;
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиОбщийСписок, "ВыбиратьИерархически", ВыбиратьИерархически);
	КонецЕсли;
	
	ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиОбщийСписок, "ГруппаПользователей", Элементы.СписокГруппПользователей.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбиратьИерархическиПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
КонецПроцедуры

&НаКлиенте
Процедура СписокГруппПользователейПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиОбщийСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);
	
	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиДоступВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);
	
	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

// Учебные группы

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииУчебнойГруппы()
	
	ТекущиеДанные = Элементы.УчебныеГруппы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиУчебныхГрупп, "УчебнаяГруппа", Элементы.УчебныеГруппы.ТекущаяСтрока);	
	
КонецПроцедуры

&НаКлиенте
Процедура УчебныеГруппыПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСодержимоеФормыПриИзмененииУчебнойГруппы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиУчебныхГруппВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);
	
	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

// Мероприятия

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииМероприятия()
	
	ТекущиеДанные = Элементы.ПроведенияМероприятий.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено
		ИЛИ НЕ ТекущиеДанные.Свойство("Ссылка") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиМероприятий, "ПроведениеОбучения", ТекущиеДанные.Ссылка);
	ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиМероприятий, "Сценарий", ТекущиеДанные.Сценарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроведенияМероприятийПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСодержимоеФормыПриИзмененииМероприятия();

КонецПроцедуры

&НаКлиенте
Процедура ПользователиМероприятийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);

	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

// Программы обучения

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииПрограммыОбучения()
	
	ТекущиеДанные = Элементы.ПроведенияПрограммОбучения.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено
		ИЛИ НЕ ТекущиеДанные.Свойство("Ссылка") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиПрограммОбучения, "ПроведениеПрограммыОбучения", ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроведенияПрограммОбученияПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСодержимоеФормыПриИзмененииПрограммыОбучения();

КонецПроцедуры

&НаКлиенте
Процедура ПользователиПрограммОбученияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);

	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

// Подчиненные

&НаКлиенте
Процедура ПодчиненныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);

	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

// Студенты

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов()
	
	Если ЗначениеЗаполнено(КурсСтудента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Студенты.Отбор, "Курс", КурсСтудента);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Студенты.Отбор, "Курс");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчебнаяГруппаСтудента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Студенты.Отбор, "УчебнаяГруппа", УчебнаяГруппаСтудента);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Студенты.Отбор, "УчебнаяГруппа");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусСтудента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Студенты.Отбор, "Статус", СтатусСтудента);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Студенты.Отбор, "Статус");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СпециализацияСтудента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Студенты.Отбор, "Специализация", СпециализацияСтудента);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Студенты.Отбор, "Специализация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СпециальностьСтудента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Студенты.Отбор, "Специальность", СпециальностьСтудента);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Студенты.Отбор, "Специальность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФормаОбученияСтудента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Студенты.Отбор, "ФормаОбучения", ФормаОбученияСтудента);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Студенты.Отбор, "ФормаОбучения");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтделениеСтудента) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Студенты.Отбор, "Отделение", ОтделениеСтудента);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Студенты.Отбор, "Отделение");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КурсСтудентаПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов();
КонецПроцедуры

&НаКлиенте
Процедура УчебнаяГруппаСтудентаПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов();
КонецПроцедуры

&НаКлиенте
Процедура СтатусСтудентаПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов();
КонецПроцедуры

&НаКлиенте
Процедура СпециализацияСтудентаПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов();
КонецПроцедуры

&НаКлиенте
Процедура СпециальностьСтудентаПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов();
КонецПроцедуры

&НаКлиенте
Процедура ФормаОбученияСтудентаПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов();
КонецПроцедуры

&НаКлиенте
Процедура ОтделениеСтудентаПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииОтбораСтудентов();
КонецПроцедуры

&НаКлиенте
Процедура СтудентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);

	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

// Пользователи учебных групп образовательной организации

&НаКлиенте
Процедура УчебныеГруппыООПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСодержимоеФормыПриИзмененииУчебнойГруппыОО();

КонецПроцедуры

&НаКлиенте
Процедура ПользователиУчебныхГруппООВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПользователя(Элемент.ТекущиеДанные.Пользователь);

	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСтудентаВыборУчебнойГруппыПриИзменении(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииУчебнойГруппыОО();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииУчебнойГруппыОО()
	
	Если ЗначениеЗаполнено(СтатусСтудента) Тогда
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиУчебныхГруппОО, "СтатусСтудента", СтатусСтудента);
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиУчебныхГруппОО, "ПустойСтатус", Ложь);
	Иначе
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиУчебныхГруппОО, "СтатусСтудента", ПредопределенноеЗначение("Справочник.СтатусыСтудентовОО.ПустаяСсылка"));
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиУчебныхГруппОО, "ПустойСтатус", Истина);
	КонецЕсли;
	
	ТекущиеДанные = Элементы.УчебныеГруппыОО.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиУчебныхГруппОО, "УчебнаяГруппа", ПредопределенноеЗначение("Справочник.УчебныеГруппыОО.ПустаяСсылка"));
	Иначе
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиУчебныхГруппОО, "УчебнаяГруппа", ТекущиеДанные.Ссылка);	
	КонецЕсли;
	
КонецПроцедуры

// Настройки доступа

&НаКлиенте
Процедура ТаблицаНастроекДоступаПриИзменении(Элемент)		
	ФормированиеПоляВводаТаблицыНастроекДоступа(Элемент);
	СформироватьПользователейНастроекДоступа();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекДоступаПриАктивизацииЯчейки(Элемент)
	ФормированиеПоляВводаТаблицыНастроекДоступа(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
		
	ВыбранныеПользователиСтроки = ВыбранныеПользователи.НайтиСтроки(Новый Структура("Исключен", Ложь));
	
	МассивПользователей = Новый Массив;
	
	Для каждого Строка Из ВыбранныеПользователиСтроки Цикл
		Если ЗначениеЗаполнено(Строка.Пользователь) Тогда
			МассивПользователей.Добавить(Строка.Пользователь);	
		КонецЕсли;
	КонецЦикла;
	
	ОповеститьОВыборе(МассивПользователей);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользователя(Команда)
	
	ИмяТаблицы = ПолучитьИмяТекущейТаблицыПользователей();
	
	Если Элементы[ИмяТаблицы].ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Пользователь = Элементы[ИмяТаблицы].ТекущиеДанные.Пользователь;
	
	ПоказатьЗначение(,Пользователь);

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьПользователя(Команда)
	ВыбратьПользователей();
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьПользователя(Команда)
	ВыбратьПользователей(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьУчебнуюГруппу(Команда)
	
	ТекущиеДанные = Элементы.УчебныеГруппы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	МассивПользователей = ПолучитьПользователейУчебнойГруппы(ТекущиеДанные.Ссылка);
	
	Для каждого Пользователь Из МассивПользователей Цикл
		ВыбратьПользователя(Пользователь);
	КонецЦикла;
	
	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьУчебнуюГруппуОО(Команда)
	
	ТекущиеДанные = Элементы.УчебныеГруппыОО.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	МассивПользователей = ПолучитьПользователейУчебнойГруппыОО(ТекущиеДанные.Ссылка);
	
	Для каждого Пользователь Из МассивПользователей Цикл
		ВыбратьПользователя(Пользователь);
	КонецЦикла;

	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфераОбмена(Команда)
	НачатьВставкуИзБуфераОбмена();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоПользователя(Команда)
	
	ОткрытьФорму("Справочник.Пользователи.ФормаОбъекта",,ЭтотОбъект); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ВариантПодбора = "ОбщийСписок" Тогда		
		Элементы.ГруппыПользователей.Видимость     = Истина;
		Элементы.ПользователиОбщийСписок.Видимость = Истина;		
	Иначе		
		Элементы.ГруппыПользователей.Видимость     = Ложь;
		Элементы.ПользователиОбщийСписок.Видимость = Ложь;		
	КонецЕсли;
	
	Если ВариантПодбора = "СтруктураОрганизации" Тогда
		Элементы.СтруктураОрганизации.Видимость    = Истина;
		Элементы.ПользователиОрганизаций.Видимость = Истина;		
	Иначе		
		Элементы.СтруктураОрганизации.Видимость    = Ложь;
		Элементы.ПользователиОрганизаций.Видимость = Ложь;		
	КонецЕсли;
	
	Если ВариантПодбора = "УчебныеГруппы" Тогда		
		Элементы.ГруппаУчебныеГруппы.Видимость      = Истина;
		Элементы.ПользователиУчебныхГрупп.Видимость = Истина;		
	Иначе		
		Элементы.ГруппаУчебныеГруппы.Видимость      = Ложь;
		Элементы.ПользователиУчебныхГрупп.Видимость = Ложь;		
	КонецЕсли;
	
	Если ВариантПодбора = "Мероприятия" Тогда		
		Элементы.ПользователиМероприятий.Видимость = Истина;
		Элементы.ПроведенияМероприятий.Видимость   = Истина;		
	Иначе		
		Элементы.ПользователиМероприятий.Видимость = Ложь;
		Элементы.ПроведенияМероприятий.Видимость   = Ложь;		
	КонецЕсли;	
	
	Если ВариантПодбора = "ПрограммыОбучения" Тогда		
		Элементы.ПользователиПрограммОбучения.Видимость = Истина;
		Элементы.ПроведенияПрограммОбучения.Видимость   = Истина;		
	Иначе		
		Элементы.ПользователиПрограммОбучения.Видимость = Ложь;
		Элементы.ПроведенияПрограммОбучения.Видимость   = Ложь;		
	КонецЕсли;
	
	Если ВариантПодбора = "Подчиненные" Тогда		
		Элементы.Подчиненные.Видимость = Истина;		
	Иначе		
		Элементы.Подчиненные.Видимость = Ложь;		
	КонецЕсли;
	
	Если ВариантПодбора = "Студенты" Тогда		
		Элементы.Студенты.Видимость = Истина;
		Элементы.ГруппаОтборСтудентов.Видимость = Истина;		
	Иначе		
		Элементы.Студенты.Видимость = Ложь;
		Элементы.ГруппаОтборСтудентов.Видимость = Ложь;
	КонецЕсли;
	
	Если ВариантПодбора = "УчебныеГруппыОО" Тогда		
		Элементы.ГруппаУчебныеГруппыОО.Видимость = Истина;
		Элементы.ПользователиУчебныхГруппОО.Видимость = Истина;		
	Иначе		
		Элементы.ГруппаУчебныеГруппыОО.Видимость = Ложь;
		Элементы.ПользователиУчебныхГруппОО.Видимость = Ложь;		
	КонецЕсли;
	
	Если ВариантПодбора = "Доступ" Тогда		
		Элементы.ГруппаНастройкиДоступа.Видимость = Истина;
		Элементы.ПользователиДоступ.Видимость = Истина;		
	Иначе		
		Элементы.ГруппаНастройкиДоступа.Видимость = Ложь;
		Элементы.ПользователиДоступ.Видимость = Ложь;
	КонецЕсли;
	
	// Убираем неиспользуемые элементы
	
	Если НЕ ХранимыеПараметры.РасширенныйПодбор Тогда
		Элементы.ГруппаКомандыВыбора.Видимость = Ложь;
		Элементы.ГруппаВыбранныеПользователи.Видимость = Ложь;
		Элементы.ФормаОК.Видимость = Ложь;
	Иначе
		Элементы.ФормаВыбратьПользователя.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗначениеПараметраКомпоновкиДанных(Знач ВладелецПараметров, Знач ИмяПараметра, Знач ЗначениеПараметра)
	
	Для каждого Параметр Из ВладелецПараметров.Параметры.Элементы Цикл
		Если Строка(Параметр.Параметр) = ИмяПараметра Тогда
			Если Параметр.Использование И Параметр.Значение = ЗначениеПараметра Тогда
				Возврат;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВладелецПараметров.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПользователя(Пользователь, Исключить = Ложь)
	
	Если ХранимыеПараметры.РасширенныйПодбор Тогда
	
		ПользовательУжеДобавлен = Ложь;
		
		НайденныеСтроки = ВыбранныеПользователи.НайтиСтроки(Новый Структура("Пользователь", Пользователь));
		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ПользовательУжеДобавлен = Истина;
		КонецЕсли;
		
		Если НЕ ПользовательУжеДобавлен Тогда
			
			НоваяСтрока = ВыбранныеПользователи.Добавить();				
			
			НоваяСтрока.Пользователь  = Пользователь;
			НоваяСтрока.НомерКартинки = 11;
			НоваяСтрока.Исключен      = Исключить;
			
		КонецЕсли;
		
	Иначе
		
		ОповеститьОВыборе(Пользователь);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяТекущейТаблицыПользователей()
	
	ИмяТаблицы = "";
	
	Если ВариантПодбора = "ОбщийСписок" Тогда
		ИмяТаблицы = "ПользователиОбщийСписок";
	КонецЕсли;
	
	Если ВариантПодбора = "СтруктураОрганизации" Тогда
		ИмяТаблицы = "ПользователиОрганизаций";
	КонецЕсли;
	
	Если ВариантПодбора = "УчебныеГруппы" Тогда
		ИмяТаблицы = "ПользователиУчебныхГрупп";
	КонецЕсли;
	
	Если ВариантПодбора = "Мероприятия" Тогда
		ИмяТаблицы = "ПользователиМероприятий";
	КонецЕсли;
	
	Если ВариантПодбора = "ПрограммыОбучения" Тогда
		ИмяТаблицы = "ПользователиПрограммОбучения";
	КонецЕсли;
	
	Если ВариантПодбора = "Подчиненные" Тогда
		ИмяТаблицы = "Подчиненные";
	КонецЕсли;
	
	Если ВариантПодбора = "Студенты" Тогда
		ИмяТаблицы = "Студенты";
	КонецЕсли;
	
	Если ВариантПодбора = "УчебныеГруппыОО" Тогда
		ИмяТаблицы = "ПользователиУчебныхГруппОО";
	КонецЕсли;
	
	Если ВариантПодбора = "Доступ" Тогда
		ИмяТаблицы = "ПользователиДоступ";
	КонецЕсли;
	
	Возврат ИмяТаблицы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьВыделенныхПользователей(Знач МассивВыделенныхСтрок)
	
	МассивПользователей = Новый Массив();
	
	Если МассивВыделенныхСтрок.Количество() < 1 Тогда
		Возврат МассивПользователей;
	КонецЕсли;
	
	Если ТипЗнч(МассивВыделенныхСтрок[0]) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат МассивВыделенныхСтрок;
	КонецЕсли;
	
	Если ТипЗнч(МассивВыделенныхСтрок[0]) = Тип("РегистрСведенийКлючЗаписи.СотрудникиСУО")
		ИЛИ ТипЗнч(МассивВыделенныхСтрок[0]) = Тип("РегистрСведенийКлючЗаписи.СтудентыОО") Тогда
	
		Для каждого Элемент Из МассивВыделенныхСтрок Цикл
			МассивПользователей.Добавить(Элемент.Пользователь);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(МассивВыделенныхСтрок[0]) = Тип("ДокументСсылка.ПрохождениеОбученияСУО")
		ИЛИ ТипЗнч(МассивВыделенныхСтрок[0]) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(МассивВыделенныхСтрок[0]));
		
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов); 
		
		ТаблицаПрохождений = Новый ТаблицаЗначений;
		ТаблицаПрохождений.Колонки.Добавить("Прохождение", ОписаниеТипов);
		
		Для каждого Элемент Из МассивВыделенныхСтрок Цикл
			НоваяСтрока = ТаблицаПрохождений.Добавить();
			НоваяСтрока.Прохождение = Элемент;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблицаПрохождений);
		Запрос.Текст =
		"ВЫБРАТЬ *
		|ПОМЕСТИТЬ Прохождения
		|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник";
		Запрос.Выполнить();
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Прохождения.Прохождение.Пользователь КАК Пользователь
			|ИЗ
			|	Прохождения КАК Прохождения";

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивПользователей;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьПользователей(Исключить = Ложь)
	
	ИмяТаблицы = ПолучитьИмяТекущейТаблицыПользователей();
	Таблица    = Элементы[ИмяТаблицы];

	Если Таблица.ТекущиеДанные = Неопределено ИЛИ Таблица.ВыделенныеСтроки.Количество() > 1 Тогда
		
		Если Таблица.ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(Таблица.ВыделенныеСтроки[0]) = Тип("СправочникСсылка.Пользователи") Тогда
			МассивПользователей = Таблица.ВыделенныеСтроки;
		Иначе
			МассивПользователей = ПреобразоватьВыделенныхПользователей(Таблица.ВыделенныеСтроки); // Вызов сервера
		КонецЕсли;
		
		Для каждого Строка Из МассивПользователей Цикл
			ВыбратьПользователя(Строка, Исключить);
		КонецЦикла;
		
	Иначе
		
		Пользователь = Элементы[ИмяТаблицы].ТекущиеДанные.Пользователь;
		
		ВыбратьПользователя(Пользователь, Исключить);
		
	КонецЕсли;
	
	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПользователейУчебнойГруппы(УчебнаяГруппа)
	
	ТаблицаПользователей = Справочники.УчебныеГруппыСУО.Участники(УчебнаяГруппа);
	
	МассивПользователей = ТаблицаПользователей.ВыгрузитьКолонку("Пользователь");
	
	Возврат Новый ФиксированныйМассив(МассивПользователей);
	
КонецФункции

&НаСервере
Функция ПолучитьПользователейУчебнойГруппыОО(УчебнаяГруппаОО)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтудентыООСрезПоследних.Пользователь
		|ИЗ
		|	РегистрСведений.СтудентыОО.СрезПоследних(, ) КАК СтудентыООСрезПоследних
		|ГДЕ
		|	СтудентыООСрезПоследних.УчебнаяГруппа = &УчебнаяГруппа
		|	И (СтудентыООСрезПоследних.Статус = &СтатусСтудента
		|			ИЛИ &ПустойСтатус)";

	// Такой же запрос есть в списке ПользователиУчебныхГруппОО
	
	Запрос.УстановитьПараметр("УчебнаяГруппа", УчебнаяГруппаОО);
	
	Если ЗначениеЗаполнено(СтатусСтудента) Тогда
		Запрос.УстановитьПараметр("СтатусСтудента", СтатусСтудента);
		Запрос.УстановитьПараметр("ПустойСтатус", Ложь);
	Иначе
		Запрос.УстановитьПараметр("СтатусСтудента", ПредопределенноеЗначение("Справочник.СтатусыСтудентовОО.ПустаяСсылка"));
		Запрос.УстановитьПараметр("ПустойСтатус", Истина);
	КонецЕсли;

	Результат = Запрос.Выполнить();
	ТаблицаПользователей = Результат.Выгрузить();
	МассивПользователей = ТаблицаПользователей.ВыгрузитьКолонку("Пользователь");

	Возврат Новый ФиксированныйМассив(МассивПользователей);	
	
КонецФункции

&НаКлиенте
Процедура НачатьВставкуИзБуфераОбмена()
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ОписаниеТипов", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ПараметрыПоиска.Вставить("ПредставлениеПоля", НСтр("ru = 'Пользователи'"));
	ПараметрыПоиска.Вставить("Сценарий", "ВставкаИзБуфераОбмена");
	
	ПараметрыВыполнения = Новый Структура;
	Обработчик = Новый ОписаниеОповещения("Подключаемый_ВставитьИзБуфераЗавершение", ЭтотОбъект, ПараметрыВыполнения);
	
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыПоиска, Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВставитьИзБуфераЗавершение(МассивПользователей, ПараметрыВыполнения) Экспорт
	
	Если ТипЗнч(МассивПользователей) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущийПользователь Из МассивПользователей Цикл
		ВыбратьПользователя(ТекущийПользователь, Ложь);
	КонецЦикла;	
	
	ВыбранныеПользователи.Сортировать("Пользователь");
	
КонецПроцедуры

// Настройки пользователей ИБ

&НаКлиенте
Процедура СброситьТаблицуПользователейИБ()
	ТаблицаПользователейИБ = Неопределено;
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПользователейИБ()
	
	Если ТипЗнч(ТаблицаПользователейИБ) = Тип("ХранилищеЗначения") Тогда
		Возврат ТаблицаПользователейИБ.Получить();
	КонецЕсли;
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	ПользователиИБТаблица = Новый ТаблицаЗначений;
	ПользователиИБТаблица.Колонки.Добавить("АутентификацияOpenID");
	ПользователиИБТаблица.Колонки.Добавить("АутентификацияОС");
	ПользователиИБТаблица.Колонки.Добавить("АутентификацияСтандартная");
	ПользователиИБТаблица.Колонки.Добавить("ЗапрещеноИзменятьПароль");
	ПользователиИБТаблица.Колонки.Добавить("Имя");
	ПользователиИБТаблица.Колонки.Добавить("ПарольУстановлен");
	ПользователиИБТаблица.Колонки.Добавить("ПоказыватьВСпискеВыбора");
	ПользователиИБТаблица.Колонки.Добавить("УникальныйИдентификатор");
	
	Для каждого ПользовательИБ Из ПользователиИБ Цикл
		НоваяСтрокаТП = ПользователиИБТаблица.Добавить();
		НоваяСтрокаТП.АутентификацияOpenID = ПользовательИБ.АутентификацияOpenID;
		НоваяСтрокаТП.АутентификацияОС = ПользовательИБ.АутентификацияОС;
		НоваяСтрокаТП.АутентификацияСтандартная = ПользовательИБ.АутентификацияСтандартная;
		НоваяСтрокаТП.ЗапрещеноИзменятьПароль = ПользовательИБ.ЗапрещеноИзменятьПароль;
		НоваяСтрокаТП.Имя = ПользовательИБ.Имя;
		НоваяСтрокаТП.ПарольУстановлен = ПользовательИБ.ПарольУстановлен;
		НоваяСтрокаТП.ПоказыватьВСпискеВыбора = ПользовательИБ.ПоказыватьВСпискеВыбора;
		НоваяСтрокаТП.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор;
	КонецЦикла;	
	
	ПользователиИБТаблица.Индексы.Добавить("АутентификацияOpenID");
	ПользователиИБТаблица.Индексы.Добавить("АутентификацияОС");
	ПользователиИБТаблица.Индексы.Добавить("АутентификацияСтандартная");
	ПользователиИБТаблица.Индексы.Добавить("ЗапрещеноИзменятьПароль");
	ПользователиИБТаблица.Индексы.Добавить("Имя");
	ПользователиИБТаблица.Индексы.Добавить("ПарольУстановлен");
	ПользователиИБТаблица.Индексы.Добавить("ПоказыватьВСпискеВыбора");
	
	ТаблицаПользователейИБ = Новый ХранилищеЗначения(ПользователиИБТаблица);
	
	Возврат ПользователиИБТаблица;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНастроекДоступа() 
		
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Вход в программу разрешен'");
	НоваяСтрока.ИмяСвойства = "ВходВПрограммуРазрешен";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	НедоступныеПоля = Новый Массив;
	НедоступныеПоля.Добавить("АутентификацияСтандартная");
	НедоступныеПоля.Добавить("АутентификацияOpenID");
	НедоступныеПоля.Добавить("АутентификацияОС");
	НедоступныеПоля.Добавить("ПоказыватьВСпискеВыбора");
	НоваяСтрока.НедоступныеПоля = Новый ФиксированныйМассив(НедоступныеПоля);
	ЗначенияНедоступностиПолей = Новый Массив;
	ЗначенияНедоступностиПолей.Добавить(Ложь);
	ЗначенияНедоступностиПолей.Добавить(Неопределено);
	НоваяСтрока.ЗначенияНедоступностиПолей = Новый ФиксированныйМассив(ЗначенияНедоступностиПолей);
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Аутентификация 1С:Предприятия'");
	НоваяСтрока.ИмяСвойства = "АутентификацияСтандартная";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЭтоСвойствоПользователяИБ = Истина;
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Аутентификация OpenID'");
	НоваяСтрока.ИмяСвойства = "АутентификацияOpenID";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЭтоСвойствоПользователяИБ = Истина;
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;

	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Аутентификация ОС'");
	НоваяСтрока.ИмяСвойства = "АутентификацияОС";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЭтоСвойствоПользователяИБ = Истина;
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Показывать в списке выбора'");
	НоваяСтрока.ИмяСвойства = "ПоказыватьВСпискеВыбора";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");	
	НоваяСтрока.ЭтоСвойствоПользователяИБ = Истина;
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Установлены настройки доступа'");
	НоваяСтрока.ИмяСвойства = "УстановленыНастройкиДоступа";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	НедоступныеПоля = Новый Массив;
	НедоступныеПоля.Добавить("ПарольУстановлен");
	НедоступныеПоля.Добавить("ЗапрещеноИзменятьПароль");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВебКабинетСУ") Тогда
		НедоступныеПоля.Добавить("ВходВВебКабинетРазрешен");
	КонецЕсли;
	НедоступныеПоля.Добавить("ЗакончилосьВремяДоступа");
	НедоступныеПоля.Добавить("Имя");
	НоваяСтрока.НедоступныеПоля = Новый ФиксированныйМассив(НедоступныеПоля);
	ЗначенияНедоступностиПолей = Новый Массив;
	ЗначенияНедоступностиПолей.Добавить(Ложь);
	ЗначенияНедоступностиПолей.Добавить(Неопределено);
	НоваяСтрока.ЗначенияНедоступностиПолей = Новый ФиксированныйМассив(ЗначенияНедоступностиПолей);		
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Пароль установлен'");
	НоваяСтрока.ИмяСвойства = "ПарольУстановлен";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЭтоСвойствоПользователяИБ = Истина;
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;

	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Запрещено изменять пароль'");
	НоваяСтрока.ИмяСвойства = "ЗапрещеноИзменятьПароль";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");	
	НоваяСтрока.ЭтоСвойствоПользователяИБ = Истина;
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВебКабинетСУ") Тогда
		НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
		НоваяСтрока.Настройка = НСтр("ru = 'Вход в веб-кабинет разрешен'");
		НоваяСтрока.ИмяСвойства = "ВходВВебКабинетРазрешен";
		НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
		НоваяСтрока.ЗначениеПоУмолчанию = Истина;
		НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Имя для входа'");
	НоваяСтрока.ИмяСвойства = "Имя";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Строка");	
	НоваяСтрока.ЭтоСвойствоПользователяИБ = Истина;
	НоваяСтрока.ЗначениеПоУмолчанию = "";
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Закончилось время доступа'");
	НоваяСтрока.ИмяСвойства = "ЗакончилосьВремяДоступа";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;

	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Недействителен'");
	НоваяСтрока.ИмяСвойства = "Недействителен";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Пометка удаления'");
	НоваяСтрока.ИмяСвойства = "ПометкаУдаления";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	НоваяСтрока.ЗначениеПоУмолчанию = Истина;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;

	РазрешитьВводНесколькихАдресовПочты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Справочники.ВидыКонтактнойИнформации.EmailПользователя, "РазрешитьВводНесколькихЗначений");
		
	Если НЕ РазрешитьВводНесколькихАдресовПочты Тогда
		
		НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
		НоваяСтрока.Настройка = НСтр("ru = 'Заполнена электронная почта'");
		НоваяСтрока.ИмяСвойства = "ЗаполненаЭлектроннаяПочта";
		НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Булево");
		НоваяСтрока.ЗначениеПоУмолчанию = Истина;
		НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;	
		
		НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
		НоваяСтрока.Настройка = НСтр("ru = 'Электронная почта'");
		НоваяСтрока.ИмяСвойства = "ЭлектроннаяПочта";
		НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("Строка");
		НоваяСтрока.ЗначениеПоУмолчанию = "";
		НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;
	
	КонецЕсли;
	
	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Группа доступа'");
	НоваяСтрока.ИмяСвойства = "ГруппаДоступа";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ГруппыДоступа");
	НоваяСтрока.ВыборГруппИЭлементов = "Элементы";
	НоваяСтрока.ЗначениеПоУмолчанию = Неопределено;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;

	НоваяСтрока = ТаблицаНастроекДоступа.Добавить();
	НоваяСтрока.Настройка = НСтр("ru = 'Группа пользователей'");
	НоваяСтрока.ИмяСвойства = "ГруппаПользователей";
	НоваяСтрока.ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ГруппыПользователей");
	НоваяСтрока.ЗначениеПоУмолчанию = Неопределено;
	НоваяСтрока.Значение = НоваяСтрока.ЗначениеПоУмолчанию;

КонецПроцедуры

&НаКлиенте
Процедура ФормированиеПоляВводаТаблицыНастроекДоступа(Элемент)
		
	ТабличноеПоле = Элемент;
	
	Если ТабличноеПоле.ТекущиеДанные <> Неопределено Тогда
		
		// Формируем текущее выбранное поле ввода
		
		ПолеВвода = ТабличноеПоле.ПодчиненныеЭлементы[ТабличноеПоле.Имя + "Значение"];
		ПолеВвода.ОграничениеТипа = ТабличноеПоле.ТекущиеДанные.ДопустимыеТипы;
		
		ВыборГруппИЭлементов = ТабличноеПоле.ТекущиеДанные.ВыборГруппИЭлементов;
		
		Если ЗначениеЗаполнено(ВыборГруппИЭлементов) Тогда
			ПолеВвода.ВыборГруппИЭлементов = ГруппыИЭлементы[ВыборГруппИЭлементов];
		Иначе
			ПолеВвода.ВыборГруппИЭлементов = ГруппыИЭлементы.Авто;
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого СтрокаТабличногоПоля Из ТаблицаНастроекДоступа Цикл
		
		// Формируем все поля
		
		Если ТипЗнч(СтрокаТабличногоПоля.НедоступныеПоля) = Тип("ФиксированныйМассив") Тогда
			
			ВыставленоЗначениеНедоступности = Ложь;
			Для каждого ЗначениеПоля Из СтрокаТабличногоПоля.ЗначенияНедоступностиПолей Цикл				
				Если ЗначениеПоля = Неопределено
					И НЕ СтрокаТабличногоПоля.ИспользоватьНастройку Тогда
					ВыставленоЗначениеНедоступности = Истина;
					Прервать;
				КонецЕсли;				
				Если СтрокаТабличногоПоля.Значение = ЗначениеПоля Тогда
					ВыставленоЗначениеНедоступности = Истина;
					Прервать;
				КонецЕсли;							
			КонецЦикла;
			
			Для каждого НедоступноеПоле Из СтрокаТабличногоПоля.НедоступныеПоля Цикл
				НедоступнаяСтрока = ТаблицаНастроекДоступа.НайтиСтроки(Новый Структура("ИмяСвойства", НедоступноеПоле))[0];
				НедоступнаяСтрока.ТолькоПросмотр = ВыставленоЗначениеНедоступности;
				Если ВыставленоЗначениеНедоступности Тогда
					НедоступнаяСтрока.ИспользоватьНастройку = Ложь;
					НедоступнаяСтрока.Значение = НедоступнаяСтрока.ЗначениеПоУмолчанию;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыНастроекДоступаПоУмолчанию()

	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ИдентификаторыПользователейИБ", Новый Массив());	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ИдентификаторыПользователейИБЗаданы", Ложь);
	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ВходВПрограммуРазрешенИдентификаторы", Новый Массив());	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ВходВПрограммуРазрешенИдентификаторыЗаданы", Ложь);
	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ВходВВебКабинетРазрешенЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ВходВВебКабинетРазрешен", Неопределено);

	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЗакончилосьВремяДоступаЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЗакончилосьВремяДоступа", Неопределено);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ПустаяДата", Дата("00010101"));
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЗаполненаЭлектроннаяПочтаЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЗаполненаЭлектроннаяПочта",Неопределено);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("КидКИЭлектроннаяПочтаПользователя", Справочники.ВидыКонтактнойИнформации.EmailПользователя);

	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЭлектроннаяПочтаЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЭлектроннаяПочта" ,Неопределено);

	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ГруппаДоступаЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ГруппаДоступа" ,Неопределено);

	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ГруппаПользователейЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ГруппаПользователей" ,Неопределено);
	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ОтобратьСПустымИдентификаторомИБ", Ложь);
	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("НедействителенЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("Недействителен", Неопределено);

	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ПометкаУдаленияЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ПометкаУдаления", Неопределено);
	
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("УстановленыНастройкиДоступаЗадано", Ложь);
	ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("УстановленыНастройкиДоступа", Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПользователейНастроекДоступа()
	
	// Сбрасываем параметры
	
	УстановитьПараметрыНастроекДоступаПоУмолчанию();
	
	// Находим пользователей по свойствам пользователей ИБ
	
	ПользователиИБ = ПолучитьТаблицуПользователейИБ();
	
	СтрокиПоискаПользователейИБ = ТаблицаНастроекДоступа.НайтиСтроки(
		Новый Структура("ИспользоватьНастройку, ЭтоСвойствоПользователяИБ", Истина, Истина)); 
		
	ИдентификаторыПользователейИБ = Неопределено;
	
	Если СтрокиПоискаПользователейИБ.Количество() > 0 Тогда
		
		ИдентификаторыПользователейИБ = Новый Массив;
		
		СтруктураПоискаПользователейИБ = Новый Структура;	
		Для каждого СтрокиПоискаПользователяИБ Из СтрокиПоискаПользователейИБ Цикл
			СтруктураПоискаПользователейИБ.Вставить(СтрокиПоискаПользователяИБ.ИмяСвойства, СтрокиПоискаПользователяИБ.Значение); 
		КонецЦикла;
		
		СтрокиПользователейИБ = ПользователиИБ.НайтиСтроки(СтруктураПоискаПользователейИБ);
		
		Для каждого СтрокаПИБ Из СтрокиПользователейИБ Цикл
			ИдентификаторыПользователейИБ.Добавить(СтрокаПИБ.УникальныйИдентификатор);
		КонецЦикла;	
		
	КонецЕсли;
	
	Если ИдентификаторыПользователейИБ = Неопределено Тогда
		ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ИдентификаторыПользователейИБ", Новый Массив());
		ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ИдентификаторыПользователейИБЗаданы", Ложь);
	Иначе
		ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ИдентификаторыПользователейИБ", ИдентификаторыПользователейИБ);
		ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ИдентификаторыПользователейИБЗаданы", Истина);
	КонецЕсли;
	
	// Формируем параметры для поиска пользователей по данным ИБ
	
	СтрокиПоискаПользователейИБ = ТаблицаНастроекДоступа.НайтиСтроки(
		Новый Структура("ЭтоСвойствоПользователяИБ", Ложь)); 	
		
	Для каждого СтрокаПБД Из СтрокиПоискаПользователейИБ Цикл
		
		Если СтрокаПБД.ИмяСвойства = "ВходВПрограммуРазрешен" Тогда
			
			ИдентификаторыПользователейИБВходРазрешен = Новый Массив;
			ИдентификаторыПользователейИБ = Новый Массив;
			
			Если СтрокаПБД.ИспользоватьНастройку Тогда
				
				МассивАутентификаций = Новый Массив;
				МассивАутентификаций.Добавить("АутентификацияСтандартная");
				МассивАутентификаций.Добавить("АутентификацияОС");
				МассивАутентификаций.Добавить("АутентификацияOpenID");
				
				Для каждого Аутентификация Из МассивАутентификаций Цикл				
					НайденныеСтроки = ПользователиИБ.НайтиСтроки(Новый Структура(Аутентификация, Истина));
					Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						Если ИдентификаторыПользователейИБВходРазрешен.Найти(НайденнаяСтрока.УникальныйИдентификатор) = Неопределено Тогда
							ИдентификаторыПользователейИБВходРазрешен.Добавить(НайденнаяСтрока.УникальныйИдентификатор);
						КонецЕсли;
					КонецЦикла;					
				КонецЦикла;
				
				Если СтрокаПБД.Значение Тогда				
					ИдентификаторыПользователейИБ = ИдентификаторыПользователейИБВходРазрешен;				
				Иначе				
					ИдентификаторыВсехПользователейИБ = ПользователиИБ.ВыгрузитьКолонку("УникальныйИдентификатор");				
					ИдентификаторыПользователейИБ = ОбщегоНазначенияКлиентСервер.СократитьМассив(ИдентификаторыВсехПользователейИБ, ИдентификаторыПользователейИБВходРазрешен);
				КонецЕсли;
				
			КонецЕсли;
			
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ВходВПрограммуРазрешенИдентификаторы", ИдентификаторыПользователейИБ);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ВходВПрограммуРазрешенИдентификаторыЗаданы", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ОтобратьСПустымИдентификаторомИБ", НЕ СтрокаПБД.Значение);
			
		КонецЕсли;
		
		Если СтрокаПБД.ИмяСвойства = "ВходВВебКабинетРазрешен" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ВходВВебКабинетРазрешенЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ВходВВебКабинетРазрешен", СтрокаПБД.Значение);
		КонецЕсли;
		
		Если СтрокаПБД.ИмяСвойства = "ЗакончилосьВремяДоступа" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЗакончилосьВремяДоступаЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЗакончилосьВремяДоступа", СтрокаПБД.Значение);
		КонецЕсли;
		
		Если СтрокаПБД.ИмяСвойства = "ЗаполненаЭлектроннаяПочта" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЗаполненаЭлектроннаяПочтаЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЗаполненаЭлектроннаяПочта", СтрокаПБД.Значение);
		КонецЕсли;
		
		Если СтрокаПБД.ИмяСвойства = "ЭлектроннаяПочта" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЭлектроннаяПочтаЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ЭлектроннаяПочта" , СтрокаПБД.Значение);
		КонецЕсли;
		
		Если СтрокаПБД.ИмяСвойства = "ГруппаДоступа" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ГруппаДоступаЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ГруппаДоступа" , СтрокаПБД.Значение);
		КонецЕсли;

		Если СтрокаПБД.ИмяСвойства = "ГруппаПользователей" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ГруппаПользователейЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ГруппаПользователей" , СтрокаПБД.Значение);
		КонецЕсли;

		Если СтрокаПБД.ИмяСвойства = "Недействителен" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("НедействителенЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("Недействителен" , СтрокаПБД.Значение);
		КонецЕсли;

		Если СтрокаПБД.ИмяСвойства = "ПометкаУдаления" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ПометкаУдаленияЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("ПометкаУдаления" , СтрокаПБД.Значение);
		КонецЕсли;
		
		Если СтрокаПБД.ИмяСвойства = "УстановленыНастройкиДоступа" Тогда
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("УстановленыНастройкиДоступаЗадано", СтрокаПБД.ИспользоватьНастройку);
			ПользователиДоступ.Параметры.УстановитьЗначениеПараметра("УстановленыНастройкиДоступа", СтрокаПБД.Значение);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры



	
#КонецОбласти
